{
  "title": "How to learn Tailwind CSS",
  "content": "<p>Prerequisites for learning Tailwind CSS<br /> After testing out Tailwind, below are the things you should have knowledge about before starting with Tailwind CSS -</p> <p>Basic HTML (especially Classes and Ids)<br /> Basic CSS<br /> Mobile and Desktop responsiveness<br /> NodeJS should be pre-installed<br /> Little knowledge about npm packages<br /> How I started<br /> Tailwind is very easy to use and to get your grasp on if you have good knowledge about CSS. Since it is that same CSS we are writing but in short, there wasn&#39;t anything extra that was needed to learn before I could start learning Tailwind.</p> <p>To start with Tailwind, I followed the playlist of Tailwind Lab&#39;s on YouTube: Tailwind CSS: from Zero to Production . This playlist really explains everything in a clear-cut and short way. I learnt how to set up a Tailwind project, that is to download all the important files( like package.json, tailwind.config file ) and other handy plugins. After been done learning about how Tailwind pretty much works, I started exploring Tailwind&#39;s documentation, which is one of the best docs I came across up till now. While fiddling with documentation and trying to implement things on my own, I learnt how to develop normal web pages with proper styling and responsiveness through Tailwind CSS. Afterwards, I jumped on to some advanced stuff like creating my own classes, how to make and use custom colours and properties!&lt; br/&gt;</p> <p>Difficulties I faced<br /> To me, the process of setting up your Tailwind project was a little difficult at first, though as time passed everything was clear to be.</p> <p><br /> Another problem I faced was since we were styling our code inside our HTML file (classes to be precised), the code started looking very confusing especially when you have to heavily style your elements.</p> <p><br /> Ease of learning<br /> It is not at all difficult to learn Tailwind CSS since as I mentioned it above that there is nothing extra you&#39;ve got to learn as we are writing that same old CSS.</p> <p><br /> Tailwind&#39;s documentation has got one of the best explanations for the same, that is its core concepts, how it works, and its usage.</p> <p><br /> The classes used in tailwind are very easy and straightforward, you wouldn&#39;t need to glance back at its docs to see class names!</p> <p>Bootstrap vs Tailwind CSS<br /> Bootstrap and Tailwind, both are one of the most used CSS frameworks.</p> <p>Bootstrap lets you quickly design and customize responsive mobile-first sites. It&#39;s the world&rsquo;s most popular front-end open-source toolkit, featuring Sass variables and mixins, responsive grid system, extensive prebuilt components, and powerful JavaScript plugins.</p> <p>1.Customizability<br /> Tailwind according to me is very flexible(customizable). You can decide all the properties and values by yourself, and there is never any need of writing extra CSS. When talking about custom properties, you can easily build your custom colour, use external fonts, etc by making a custom property in your Tailwind config file<br /> Unlike Tailwind CSS, Bootstrap is not very customizable because it have pre-styled elements, and there can be times when you might consider making a CSS file for changing the default styling provided by Bootstrap and adding a bit of your own touch.<br /> 2.Usage with CSS Preprocessors<br /> Since Tailwind is a PostCSS plugin, it can easily be used with other preprocessors like Sass, Less, Stylus and others, just like you can with other PostCSS plugins like Autoprefixer.<br /> Bootstrap comes with vanilla CSS, but its source code utilizes the two most popular CSS preprocessors, Less and Sass. It by default comes with Sass variables and mixins.<br /> 3.Removal of unused classes<br /> Both Tailwind CSS and Bootstrap uses PurgeCSS to remove all the untouched css classes which are only helping in increasing the file size.</p> <p>4.Looks<br /> Tailwind:</p> <p>Simple card design with Tailwind</p> <p>A simple card design with Tailwind&nbsp;</p> <p><br /> Tailwind code</p> <p>Tailwind code<br /> Tailwind:</p> <p>Simple card design with Bootstrap</p> <p>A simple card design with Bootstrap</p> <p><br /> Bootstrap code</p> <p>Bootstrap code</p> <p><br /> Well, both look good in their own way but then again bootstrap is less customizable and I would have to write extra CSS in order to change its appearance according to my website&#39;s theme.</p> <p>Final Thoughts<br /> Below are some reasons why I believe that Tailwind is worth using-</p> <p>It&#39;s very beginner-friendly. While building web pages, you won&#39;t even need to leave your HTML file!<br /> Unlike Bootstrap, It is highly customizable<br /> You don&#39;t have to worry about unnecessary code, PurgeCSS will take care of it.<br /> It has memorable class name. So you won&#39;t need to repeatedly go back to the documentation<br /> You can even make your own classes, so you won&#39;t have to repeat the same code again and again.</p>",
  "author": "Gourav Rana",
  "metadesc": "Learn tailwind in few minutes.I will teach you in few minutes",
  "slug": "how-to-learn-tailwindcss"
}
