{
  "title": "How to learn Python",
  "content": "<h3>Tip #1: Code Everyday</h3> <p>Consistency is very important when you are learning a new language. We recommend making a commitment to code every day. It may be hard to believe, but muscle memory plays a large part in programming. Committing to coding everyday will really help develop that muscle memory. Though it may seem daunting at first, consider starting small with 25 minutes everyday and working your way up from there.</p> <p>Check out the&nbsp;First Steps With Python Guide&nbsp;for information on setup as well as exercises to get you started.</p> <h3>Tip #2: Write It Out</h3> <p>As you progress on your journey as a new programmer, you may wonder if you should be taking notes. Yes, you should! In fact, research suggests that taking notes by hand is most beneficial for long-term retention. This will be especially beneficial for those working towards the goal of becoming a full-time developer, as many&nbspinterviews&nbsp;will involve writing code on a whiteboard.</p> <p>Once you start working on small projects and programs, writing by hand can also help you plan your code before you move to the computer. You can save a lot of time if you write out which functions and classes you will need, as well as how they will interact.</p> <h3>Tip #3: Go Interactive!</h3> <p>Whether you are learning about basic Python data structures (strings, lists, dictionaries, etc.) for the first time, or you are debugging an application, the interactive Python shell will be one of your best learning tools. We use it a lot on this site too!</p> <p>To use the interactive Python shell (also sometimes called a&nbsp;&ldquo;Python REPL&rdquo;), first make sure Python is installed on your computer. We&rsquo;ve got a step-by-step tutorial to help you do that. To activate the interactive Python shell, simply open your terminal and run&nbsp;<code>python</code>&nbsp;or&nbsp;<code>python3</code>&nbsp;depending on your installation. You can find more specific directions&nbsp;here.</p> <p>Now that you know how to start the shell, here are a few examples of how you can use the shell when you are learning:</p> <h3>Tip #4: Take Breaks</h3> <p>When you are learning, it is important to step away and absorb the concepts. The&nbspPomodoro Technique&nbsp;is widely used and can help: you work for 25 minutes, take a short break, and then repeat the process. Taking breaks is critical to having an effective study session, particularly when you are taking in a lot of new information.</p> <p>Breaks are especially important when you are debugging. If you hit a bug and can&rsquo;t quite figure out what is going wrong, take a break. Step away from your computer, go for a walk, or chat with a friend.</p> <p>In programming, your code must follow the rules of a language and logic exactly, so even missing a quotation mark will break everything. Fresh eyes make a big difference.</p> <h3>Tip #5: Become a Bug Bounty Hunter</h3> <p>Speaking of hitting a bug, it is inevitable once you start writing complex programs that you will run into bugs in your code. It happens to all of us! Don&rsquo;t let bugs frustrate you. Instead, embrace these moments with pride and think of yourself as a bug bounty hunter.</p> <p>When debugging, it is important to have a methodological approach to help you find where things are breaking down. Going through your code in the order in which it is executed and making sure each part works is a great way to do this.</p> <p>Once you have an idea of where things might be breaking down, insert the following line of code into your script&nbsp;<code>import pdb; pdb.set_trace()</code>&nbsp;and run it. This is the&nbsp;Python debugger&nbsp;and will drop you into interactive mode. The debugger can also be run from the command line with&nbsp;<code>python -m pdb &lt;my_file.py&gt;</code>.</p> <h2>Make It Collaborative</h2> <p>Once things start to stick, expedite your learning through collaboration. Here are some strategies to help you get the most out of working with others.</p> <h3>Tip #6: Surround Yourself With Others Who Are Learning</h3> <p>Though coding may seem like a solitary activity, it actually works best when you work together. It is extremely important when you are learning to code in Python that you surround yourself with other people who are learning as well. This will allow you to share the tips and tricks you learn along the way.</p> <p>Don&rsquo;t worry if you don&rsquo;t know anyone. There are plenty of ways to meet others who are passionate about learning Python! Find local events or Meetups or join&nbspPythonistaCafe, a peer-to-peer learning community for Python enthusiasts like you!</p> <h3>Tip #7: Teach</h3> <p>It is said that the best way to learn something is to teach it. This is true when you are learning Python. There are many ways to do this: whiteboarding with other Python lovers, writing blog posts explaining newly learned concepts, recording videos in which you explain something you learned, or simply talking to yourself at your computer. Each of these strategies will solidify your understanding as well as expose any gaps in your understanding.</p> <h3>Tip #8: Pair Program</h3> <p>Pair programming&nbsp;is a technique that involves two developers working at one workstation to complete a task. The two developers switch between being the &ldquo;driver&rdquo; and the &ldquo;navigator.&rdquo; The &ldquo;driver&rdquo; writes the code, while the &ldquo;navigator&rdquo; helps guide the problem solving and reviews the code as it is written. Switch frequently to get the benefit of both sides.</p> <p>Pair programming has many benefits: it gives you a chance to not only have someone review your code, but also see how someone else might be thinking about a problem. Being exposed to multiple ideas and ways of thinking will help you in problem solving when you got back to coding on your own.</p> <h3>Tip #9: Ask &ldquo;GOOD&rdquo; Questions</h3> <p>People always say there is no such thing as a bad question, but when it comes to programming, it is possible to ask a question badly. When you are asking for help from someone who has little or no context on the problem you are trying to solve, its best to ask GOOD questions by following this acronym:</p> <ul> <li><strong>G</strong>: Give context on what you are trying to do, clearly describing the problem.</li> <li><strong>O</strong>: Outline the things you have already tried to fix the issue.</li> <li><strong>O</strong>: Offer your best guess as to what the problem might be. This helps the person who is helping you to not only know what you are thinking, but also know that you have done some thinking on your own.</li> <li><strong>D</strong>: Demo what is happening. Include the code, a&nbsptraceback&nbsp;error message, and an explanation of the steps you executed that resulted in the error. This way, the person helping does not have to try to recreate the issue.</li> </ul> <p>Good questions can save a lot of time. Skipping any of these steps can result in back-and-forth conversations that can cause conflict. As a beginner, you want to make sure you ask good questions so that you practice communicating your thought process, and so that people who help you will be happy to continue helping you.</p> <h2>Make Something</h2> <p>Most, if not all, Python developers you speak to will tell you that in order to learn Python, you must learn by doing. Doing exercises can only take you so far: you learn the most by building.</p> <h3>Tip #10: Build Something, Anything</h3> <p>For beginners, there are many small exercises that will really help you become confident with Python, as well as develop the muscle memory that we spoke about above. Once you have a solid grasp on basic data structures (strings, lists, dictionaries, sets),&nbspobject-oriented programming, and writing classes, it&rsquo;s time to start building!</p> <p>What you build is not as important as how you build it.&nbsp;The journey of building is truly what will teach you the most. You can only learn so much from reading Real Python articles and courses. Most of your learning will come from using Python to build something. The problems you will solve will teach you a lot.</p> <p>There are many lists out there with ideas for beginner Python projects. Here are some ideas to get you started:</p> <ul> <li>Number guessing game</li> <li>Simple calculator app</li> <li>Dice roll simulator</li> <li>Bitcoin Price Notification Service</li> </ul> <p>If you find it difficult to come up with Python practice projects to work on, watch&nbspthis video. It lays out a strategy you can use to generate thousands of project ideas whenever you feel stuck.</p> <h3>Tip #11: Contribute to Open Source</h3> <p>In the open-source model, software source code is available publicly, and anyone can collaborate. There are many Python libraries that are open-source projects and take contributions. Additionally, many companies publish open-source projects. This means you can work with code written and produced by the engineers working in these companies.</p> <p>Contributing to an open-source Python project&nbsp;is a great way to create extremely valuable learning experiences. Let&rsquo;s say you decide to submit a bug fix request: you submit a&nbsp;&ldquo;pull request&rdquo;&nbsp;for your fix to be patched into the code.</p> <p>Next, the project managers will review your work, providing comments and suggestions. This will enable you to learn best practices for Python programming, as well as practice communicating with other developers.</p> <p>&nbsp;</p>",
  "author": "Gourav Rana",
  "metadesc": "Learn python in few minutes.I will teach you flask in few minutes",
  "slug": "how-to-learn-python"
}
